In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame(np.arange(0,9).reshape(3,3),
                  index = 'R1 R2 R3'.split(),
                  columns='C1 C2 C3'.split())

df2 = pd.DataFrame(np.arange(10,19).reshape(3,3),
                  index = 'R4 R5 R6'.split(),
                  columns='C1 C2 C3'.split())

In [4]:
df1

    C1  C2  C3
R1   0   1   2
R2   3   4   5
R3   6   7   8

In [5]:
df2

    C1  C2  C3
R4  10  11  12
R5  13  14  15
R6  16  17  18

In [6]:
#concate the rows between dataframes 
pd.concat([df1,df2],axis=0)

    C1  C2  C3
R1   0   1   2
R2   3   4   5
R3   6   7   8
R4  10  11  12
R5  13  14  15
R6  16  17  18

In [7]:
#Aligned data frames 

df1 = pd.DataFrame(np.arange(0,9).reshape(3,3),
                  index = 'R1 R2 R3'.split(),
                  columns='C1 C2 C3'.split())

df2 = pd.DataFrame(np.arange(10,19).reshape(3,3),
                  index = 'R1 R2 R3'.split(),
                  columns='C4 C5 C6'.split())

In [10]:
df1

    C1  C2  C3
R1   0   1   2
R2   3   4   5
R3   6   7   8

In [11]:
df2

    C4  C5  C6
R1  10  11  12
R2  13  14  15
R3  16  17  18

In [9]:
pd.concat([df1,df2],axis=1)

    C1  C2  C3  C4  C5  C6
R1   0   1   2  10  11  12
R2   3   4   5  13  14  15
R3   6   7   8  16  17  18

In [12]:
#misaligned DataFrames

In [17]:
df1 = pd.DataFrame(np.arange(0,9).reshape(3,3),
                  index="R1 R2 R3".split(),
                  columns="C1 C2 C3".split())
df2 = pd.DataFrame(np.arange(10,19).reshape(3,3),
                  index="R2 R3 R4".split(),
                  columns="C2 C3 C4".split())

In [24]:
#pd.concat([df1,df2],axis=1)
pd.concat([df1,df2],axis=0)

     C1  C2  C3    C4
R1  0.0   1   2   NaN
R2  3.0   4   5   NaN
R3  6.0   7   8   NaN
R2  NaN  10  11  12.0
R3  NaN  13  14  15.0
R4  NaN  16  17  18.0

In [ ]:
#verify the integrity of the data

In [25]:
#pd.concat([df1,df2],axis=0,sort=False,verify_integrity=True)

In [20]:
#alternative way of checking integrity but use implicit index (way to handle overlapping columns)

In [21]:
pd.concat([df1,df2],axis=1,sort=False,ignore_index=True)

      0    1    2     3     4     5
R1  0.0  1.0  2.0   NaN   NaN   NaN
R2  3.0  4.0  5.0  10.0  11.0  12.0
R3  6.0  7.0  8.0  13.0  14.0  15.0
R4  NaN  NaN  NaN  16.0  17.0  18.0

In [ ]:
#Inner join vs outer join

In [26]:
df1

    C1  C2  C3
R1   0   1   2
R2   3   4   5
R3   6   7   8

In [27]:
df2

    C2  C3  C4
R2  10  11  12
R3  13  14  15
R4  16  17  18

In [28]:
pd.concat([df1,df2],axis=1,sort=False,join='inner')

    C1  C2  C3  C2  C3  C4
R2   3   4   5  10  11  12
R3   6   7   8  13  14  15

In [30]:
#Concat is very similar to the append function

In [ ]:
#merge is Similar to SQL joins

In [31]:
df1 = pd.DataFrame({'key':['A','B','C','D'],'value':np.random.randn(4)})
df2 = pd.DataFrame({'key':['B','D','D','E'],'value':np.random.randn(4)})

In [32]:
df1

  key     value
0   A -1.698945
1   B -1.479961
2   C -2.963426
3   D -1.142248

In [33]:
df2

  key     value
0   B  0.879744
1   D  0.248413
2   D  1.779383
3   E  0.478536

In [34]:
pd.merge(df1,df2, how='inner',on='key')
#how determines the join type - Inner, outer, left, right

  key   value_x   value_y
0   B -1.479961  0.879744
1   D -1.142248  0.248413
2   D -1.142248  1.779383

In [35]:
pd.merge(df1,df2, how='outer',on='key')

  key   value_x   value_y
0   A -1.698945       NaN
1   B -1.479961  0.879744
2   C -2.963426       NaN
3   D -1.142248  0.248413
4   D -1.142248  1.779383
5   E       NaN  0.478536

In [36]:
pd.merge(df1,df2, how='left',on='key')

  key   value_x   value_y
0   A -1.698945       NaN
1   B -1.479961  0.879744
2   C -2.963426       NaN
3   D -1.142248  0.248413
4   D -1.142248  1.779383

In [37]:
pd.merge(df1,df2, how='right',on='key')

  key   value_x   value_y
0   B -1.479961  0.879744
1   D -1.142248  0.248413
2   D -1.142248  1.779383
3   E       NaN  0.478536

In [38]:
df1

  key     value
0   A -1.698945
1   B -1.479961
2   C -2.963426
3   D -1.142248

In [39]:
df2

  key     value
0   B  0.879744
1   D  0.248413
2   D  1.779383
3   E  0.478536

In [40]:
idf2 = df2.set_index('key')
idf2

        value
key
B    0.879744
D    0.248413
D    1.779383
E    0.478536

In [41]:
pd.merge(df1,idf2,left_on='key',right_index=True)

  key   value_x   value_y
1   B -1.479961  0.879744
3   D -1.142248  0.248413
3   D -1.142248  1.779383

In [42]:
idf1 = df1.set_index('key')

In [43]:
idf1

        value
key
A   -1.698945
B   -1.479961
C   -2.963426
D   -1.142248

In [45]:
pd.merge(idf1,idf2,left_index=True,right_index=True)

      value_x   value_y
key
B   -1.479961  0.879744
D   -1.142248  0.248413
D   -1.142248  1.779383